from 주민등록 import *
행정기관코드, 행정기관, 총인구수, 세대수 = get_주민등록인구('202105_202105_주민등록인구및세대현황_월간')
행정기관좌표 = get_행정기관좌표(행정기관코드)


# 중심
인구합=0;
중심좌표합=[0,0]

for i in range(len(행정기관)):
    # 포함관계인 행정구역 제거
    if (len(행정기관)!= i+1):
        if (행정기관[i+1].count(trim(행정기관[i]))):
            if ( not 행정기관[i+1].count('출장소')):
                continue;
    
    if(not 행정기관좌표[i]): continue;
    인구합+= 총인구수[i]
    #print(행정기관[i],행정기관좌표[i])
    중심좌표합[0] += float(행정기관좌표[i][0].replace(',',''))*총인구수[i]
    중심좌표합[1] += float(행정기관좌표[i][1].replace(',',''))*총인구수[i]
    
print(중심좌표합[0]/인구합, 중심좌표합[1]/인구합)
#36.64224485963227 127.49153315207039 2021.05